## Staging: ecs

**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  

**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show Plan</summary>

```terraform
module.masked_metrics.aws_cloudwatch_log_group.log: Refreshing state... [id=/aws/ecs/masked_metrics_ecs]
module.unmasked_metrics.aws_cloudwatch_log_group.log: Refreshing state... [id=/aws/ecs/unmasked_metrics_ecs]
module.unmasked_metrics.aws_cloudwatch_event_rule.event_rule: Refreshing state... [id=unmasked_metrics_event_rule]
aws_ecs_cluster.in_app_metrics: Refreshing state... [id=arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics]
module.masked_metrics.aws_cloudwatch_event_rule.event_rule: Refreshing state... [id=masked_metrics_event_rule]
aws_iam_role.container_execution_role: Refreshing state... [id=container_execution_role]
aws_iam_role.scheduled_task_cw_event_role: Refreshing state... [id=etl-st-cw-role]
aws_iam_role.task_execution_role: Refreshing state... [id=metrics_task_execution_role]
module.unmasked_metrics.aws_ecs_task_definition.task_def: Refreshing state... [id=unmasked_metrics]
module.masked_metrics.aws_ecs_task_definition.task_def: Refreshing state... [id=masked_metrics]
aws_iam_role_policy.scheduled_task_cw_event_role_cloudwatch_policy: Refreshing state... [id=etl-st-cw-role:etl-st-cw-policy]
module.masked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task: Refreshing state... [id=masked_metrics_event_rule-terraform-20210617204945093200000002]
module.unmasked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task: Refreshing state... [id=unmasked_metrics_event_rule-terraform-20210617204945092200000001]
aws_iam_policy.etl_policies: Refreshing state... [id=arn:aws:iam::005133826942:policy/ETLTaskExecutionPolicies]
aws_iam_role_policy_attachment.te_etl_policies: Refreshing state... [id=metrics_task_execution_role-20210614163001316100000003]
aws_iam_role_policy_attachment.ce_cs: Refreshing state... [id=container_execution_role-20210614144933509400000001]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.masked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_metrics_event_rule-terraform-20210617204945093200000002"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_metrics:27" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_metrics:27" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:273c4801d35f3d087dff3d15d869c7e1559fce38" -> "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
                    # (9 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_metrics" -> (known after apply)
      ~ revision                 = 27 -> (known after apply)
      ~ tags                     = {
          + "CostCentre" = "CovidShield"
        }
      ~ tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
        # (7 unchanged attributes hidden)
    }

  # module.unmasked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_metrics_event_rule-terraform-20210617204945092200000001"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_metrics:25" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_metrics:25" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:273c4801d35f3d087dff3d15d869c7e1559fce38" -> "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
                    # (9 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_metrics" -> (known after apply)
      ~ revision                 = 25 -> (known after apply)
      ~ tags                     = {
          + "CostCentre" = "CovidShield"
        }
      ~ tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"
```
</details>